app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_name", "current_status", "course_url", "start_date", "end_date", "notes", "created_at", "updated_at") VALUES ('Jen''s Postman Class', 'Ongoing', 'jenbauer.com', '2024-10-22', '2024-10-23', 'Just a few thoughts.', '2024-10-22 17:18:05.232458', '2024-10-22 17:18:05.232458') RETURNING "id"
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "notes" = 'Test 2', "updated_at" = '2024-10-22 17:58:02.348612' WHERE "courses"."id" = 3
---
  def update
    respond_to do |format|
      if @course.update(course_params)

DELETE FROM "courses" WHERE "courses"."id" = 2
---
  def destroy
    @course.destroy!

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
---
    def set_course
      @course = Course.find(params.expect(:id))